docs/exemplo_requisicao_mni_tjms.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
================================================================================
EXEMPLO DE REQUISIÇÃO SOAP - MNI TJ-MS (Modelo Nacional de Interoperabilidade)
================================================================================

Endpoint: https://esaj.tjms.jus.br/mniws/servico-intercomunicacao-2.2.2/intercomunicacao
Método HTTP: POST
Content-Type: text/xml; charset=utf-8
SOAPAction: ""

Este é o XML enviado para consultar processos no TJ-MS via MNI 2.2.2
================================================================================
-->

<!-- ============================================ -->
<!-- EXEMPLO 1: Consulta básica de processo      -->
<!-- Retorna: dados do processo + movimentos     -->
<!-- ============================================ -->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ser="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/"
                  xmlns:tip="http://www.cnj.jus.br/tipos-servico-intercomunicacao-2.2.2">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:consultarProcesso>
            <!-- Credenciais de acesso ao MNI -->
            <tip:idConsultante>usuario_mni</tip:idConsultante>
            <tip:senhaConsultante>senha_mni</tip:senhaConsultante>

            <!-- Número CNJ do processo (apenas dígitos, sem formatação) -->
            <!-- Exemplo: 0831289-65.2024.8.12.0001 vira 08312896520248120001 -->
            <tip:numeroProcesso>08312896520248120001</tip:numeroProcesso>

            <!-- Incluir movimentos processuais na resposta -->
            <tip:movimentos>true</tip:movimentos>

            <!-- Incluir lista de documentos (metadados, não o conteúdo) -->
            <tip:incluirDocumentos>true</tip:incluirDocumentos>
        </ser:consultarProcesso>
    </soapenv:Body>
</soapenv:Envelope>


<!-- ============================================ -->
<!-- EXEMPLO 2: Download de documentos           -->
<!-- Retorna: conteúdo dos documentos em base64  -->
<!-- ============================================ -->

<!--
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ser="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/"
                  xmlns:tip="http://www.cnj.jus.br/tipos-servico-intercomunicacao-2.2.2">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:consultarProcesso>
            <tip:idConsultante>usuario_mni</tip:idConsultante>
            <tip:senhaConsultante>senha_mni</tip:senhaConsultante>
            <tip:numeroProcesso>08312896520248120001</tip:numeroProcesso>

            <!-- IDs dos documentos a baixar (obtidos na consulta anterior) -->
            <tip:documento>12345678</tip:documento>
            <tip:documento>87654321</tip:documento>
            <tip:documento>11223344</tip:documento>
        </ser:consultarProcesso>
    </soapenv:Body>
</soapenv:Envelope>
-->


<!-- ============================================ -->
<!-- EXEMPLO 3: Consulta simples (sem documentos)-->
<!-- Mais rápido, retorna apenas dados básicos   -->
<!-- ============================================ -->

<!--
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ser="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/"
                  xmlns:tip="http://www.cnj.jus.br/tipos-servico-intercomunicacao-2.2.2">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:consultarProcesso>
            <tip:idConsultante>usuario_mni</tip:idConsultante>
            <tip:senhaConsultante>senha_mni</tip:senhaConsultante>
            <tip:numeroProcesso>08312896520248120001</tip:numeroProcesso>
            <tip:movimentos>false</tip:movimentos>
            <tip:incluirDocumentos>false</tip:incluirDocumentos>
        </ser:consultarProcesso>
    </soapenv:Body>
</soapenv:Envelope>
-->
