ExemploSOAPTesting/consultaProcesso_envio.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<SOAP-ENV:Body>
		<consultarProcesso xmlns="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/">
			<idConsultante xmlns="http://www.cnj.jus.br/tipos-servico-intercomunicacao-2.2.2">PGMBH</idConsultante>
			<senhaConsultante xmlns="http://www.cnj.jus.br/tipos-servico-intercomunicacao-2.2.2">12345678</senhaConsultante>
			<numeroProcesso xmlns="http://www.cnj.jus.br/tipos-servico-intercomunicacao-2.2.2">07317936620188070016</numeroProcesso>
			<dataReferencia xmlns="http://www.cnj.jus.br/tipos-servico-intercomunicacao-2.2.2">19000101000000</dataReferencia>
			<movimentos xmlns="http://www.cnj.jus.br/tipos-servico-intercomunicacao-2.2.2">false</movimentos>
			<incluirDocumentos xmlns="http://www.cnj.jus.br/tipos-servico-intercomunicacao-2.2.2">false</incluirDocumentos>
			<incluirCabecalho xmlns="http://www.cnj.jus.br/tipos-servico-intercomunicacao-2.2.2">true</incluirCabecalho>
		</consultarProcesso>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
