exercicios/ex012/imagens/request_TJSP_15082023_1529.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.cnj.jus.br/tipos-servico-intercomunicacao-2.2.2" xmlns:ns2="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/">
  <SOAP-ENV:Body>
    <ns2:consultarProcesso>
      <ns1:idConsultante>28060424000160</ns1:idConsultante>
      
      <ns1:numeroProcesso>12135154</ns1:numeroProcesso>
      <ns1:movimentos>0</ns1:movimentos>
      <ns1:incluirDocumentos>0</ns1:incluirDocumentos>
    </ns2:consultarProcesso>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>